tests/BtmsGateway.IntegrationTests/Fixtures/ErrorNotification.xml

<?xml version="1.0" encoding="UTF-8"?><NS1:Envelope xmlns:NS1="http://www.w3.org/2003/05/soap-envelope"><NS1:Header><NS2:Security xmlns:NS2="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" NS1:role="system"><NS2:UsernameToken><NS2:Username>default-username</NS2:Username><NS2:Password>default-password</NS2:Password></NS2:UsernameToken></NS2:Security></NS1:Header><NS1:Body><NS3:HMRCErrorNotification xmlns:NS3="http://uk.gov.hmrc.ITSW2.ws">&lt;NS2:HMRCErrorNotification xmlns:NS2=&quot;http://www.hmrc.gov.uk/webservices/itsw/ws/hmrcerrornotification&quot;&gt;&lt;NS2:ServiceHeader&gt;&lt;NS2:SourceSystem&gt;ALVS&lt;/NS2:SourceSystem&gt;&lt;NS2:DestinationSystem&gt;CDS&lt;/NS2:DestinationSystem&gt;&lt;NS2:CorrelationId&gt;111&lt;/NS2:CorrelationId&gt;&lt;NS2:ServiceCallTimestamp&gt;2025-09-08T09:00:00.000&lt;/NS2:ServiceCallTimestamp&gt;&lt;/NS2:ServiceHeader&gt;&lt;NS2:Header&gt;&lt;NS2:SourceCorrelationId&gt;222&lt;/NS2:SourceCorrelationId&gt;&lt;NS2:EntryReference&gt;25GB0XX00XXXXX0000&lt;/NS2:EntryReference&gt;&lt;NS2:EntryVersionNumber&gt;1&lt;/NS2:EntryVersionNumber&gt;&lt;/NS2:Header&gt;&lt;NS2:Error&gt;&lt;NS2:ErrorCode&gt;ALVSVAL312&lt;/NS2:ErrorCode&gt;&lt;NS2:ErrorMessage&gt;The DocumentControl field (Ex-Heading flag) must be Y or N. Value supplied was null. Your service request with Correlation ID 341735 has been terminated.&lt;/NS2:ErrorMessage&gt;&lt;/NS2:Error&gt;&lt;/NS2:HMRCErrorNotification&gt;</NS3:HMRCErrorNotification></NS1:Body></NS1:Envelope>